class Book < ActiveRecord::Base
  belongs_to :publisher

  enum availability: %i(Κυκλοφορεί Υπό\ Έκδοση Εξαντλημένο Κυκλοφορεί\ -\ Εκκρεμής\ εγγραφή Έχει\ αποσυρθεί\ από\ την\ κυκλοφορία)
  enum cover_type: %i(Μαλακό\ εξώφυλλο Σκληρό\ εξώφυλλο Spiral)
  enum format: %i(Βιβλίο CD-ROM CD-Audio Κασέτα Χάρτης Επιτραπέζιο\ παιχνίδι Κασέτα\ VHS Παιχνίδια-Κατασκευές DVD-ROM Video\ DVD Video\ CD e-book Άλλο )
  enum original_language: %i(Αγγλικά Αλβανικά Αραβικά Αρμενικά Αρχαία\ Ελληνικά Αφρικάανς Αϊτινά\ Κρεολικά Βασκικά Βιετναμικά Βουλγαρικά Γίντις Γαλλικά Γερμανικά Γερμανοεβραϊκά Γεωργιανά Δανέζικα Εβραϊκά Ελληνικά Ελληνικά\ Της\ Βίβλου Ελληνικά\ Του\ Βυζαντίου Εσπεράντο Θιβετιανά Ιαπωνικά Ινδικά Ιρλανδικά Ισλανδικά Ισπανικά Ιταλικά Καταλανικά Κινεζικά Κοπτικά Κορεατικά Κουρδικά Κροατικά Λατινικά Λιθουανικά Νορβηγικά Ολλανδικά Ουγγρικά Ουκρανικά Περσικά Πολωνικά Πομακικά Πορτογαλικά Ρουμανικά Ρωσικά Σερβικά Σερβο-κροατικά Σερβοβοσνιακά Σλαβομακεδονικά Σλοβακικά Σλοβενικά Σουηδικά Τουρκικά Τσεχικά Φινλανδικά Φλαμανδικά)
end

